app/Controllers/Siswa.php

SELECT *
FROM `siswa`
---
    public function index()
    {

        $data = [
            'title' => 'Data Siswa',
            'menu' => 'siswa',
            'icon' => 'fas fa-user-graduate',
            'siswa' => $this->siswaModel->findAll(),

SELECT *
FROM `siswa`
WHERE `siswa`.`id` = '1'
---
    public function getSiswaById()
    {
        $id = $this->request->getPost('id');
        $siswa = $this->siswaModel->find($id);